;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! tide)
(package! typescript-mode)
(package! prettier-js)
(package! buffer-move)
(package! forge)
(package! helm-descbinds)
(package! keychain-environment)
(package! restclient)
